Schools_And_Students/app/controllers/schools_controller.rb

INSERT INTO "schools" ("name", "location", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Columbia"], ["location", "Manhttan"], ["created_at", "2017-09-12 03:48:09.376242"], ["updated_at", "2017-09-12 03:48:09.376242"]]
---
  def create
    puts school_params
    @school = School.new(school_params)

    respond_to do |format|
      if @school.save