Schools_And_Students/app/controllers/students_controller.rb

  def new
    @student = Student.new
    schools = School.all
---
SELECT "schools".* FROM "schools"

  def edit
    schools = School.all
---
SELECT "schools".* FROM "schools"

  def create
    schoolName = student_params[:school]
    copyParams = student_params
    copyParams[:school] = School.find_by(name: schoolName)
    puts copyParams
    @student = Student.new(copyParams)

    respond_to do |format|
      if @student.save
---
SELECT  "schools".* FROM "schools" WHERE "schools"."name" = $1 LIMIT $2  [["name", "Columbia"], ["LIMIT", 1]]
INSERT INTO "students" ("name", "age", "email", "phonenumber", "school_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "t"], ["age", 2], ["email", "t"], ["phonenumber", "t"], ["school_id", 3], ["created_at", "2017-09-12 04:07:29.057689"], ["updated_at", "2017-09-12 04:07:29.057689"]]