Schools_And_Students/app/views/schools/show.html.erb

    <ul>
        <%@school.students.each do |student|%>
---
SELECT "students".* FROM "students" WHERE "students"."school_id" = $1  [["school_id", 1]]