Schools_And_Students/app/views/students/_form.html.erb

SELECT "schools".* FROM "schools"
---
  <%= f.label :school %>
  <%=f.select :school, @schools%>